app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-08-09 13:49:10.738780"], ["updated_at", "2018-08-09 13:49:10.738780"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-08-09 13:49:10.741538"], ["updated_at", "2018-08-09 13:49:10.741538"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    @songs = Song.all
    binding.pry
    CSV.foreach(params[:songs].path, headers: true) do |song|

      @artist = Artist.find_or_create_by(name: song[1])